In [1]:
import pandas as pd
import numpy as np
d = {'c1': pd.Series(['A', 'B', 'C']),    
      'c2': pd.Series([1, 2., 3., 4.])}

In [2]:
d

{'c1': 0    A
 1    B
 2    C
 dtype: object, 'c2': 0    1.0
 1    2.0
 2    3.0
 3    4.0
 dtype: float64}

In [5]:
df=pd.DataFrame(d)

In [6]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [7]:
d['c1'].isnull()

0    False
1    False
2    False
dtype: bool

In [8]:
df['c1'].isnull()

0    False
1    False
2    False
3     True
Name: c1, dtype: bool

In [9]:
df['c2'].isnull().value_counts()

False    4
Name: c2, dtype: int64

In [10]:
df['c1'].isnull().value_counts()

False    3
True     1
Name: c1, dtype: int64

In [11]:
dr=df['c2'].dropna()#drop rows of the nulll value

In [12]:
dr

0    1.0
1    2.0
2    3.0
3    4.0
Name: c2, dtype: float64

In [14]:
dr=df['c1'].dropna()

In [15]:
dr

0    A
1    B
2    C
Name: c1, dtype: object

In [16]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [18]:
dr=df.dropna(how='any')

In [19]:
dr

  c1   c2
0  A  1.0
1  B  2.0
2  C  3.0

In [20]:
df

    c1   c2
0    A  1.0
1    B  2.0
2    C  3.0
3  NaN  4.0

In [21]:
#########################

In [22]:
#Filling the missing data

In [24]:
df=pd.DataFrame(np.random.randn(5,3),index=['a0','a10','a20','a30','a40'],columns=['X','Y','Z'])

In [25]:
df

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a10 -0.069955 -0.908090 -0.781912
a20 -0.755704 -0.556427  0.635330
a30 -0.131948 -2.773040  2.636289
a40  0.827439 -1.507721 -0.983563

In [26]:
df.to_csv('data.csv')

In [28]:
d=pd.read_csv('data.csv')

In [29]:
d

  Unnamed: 0         X         Y         Z
0         a0 -1.129443 -0.071093 -0.536263
1        a10 -0.069955 -0.908090 -0.781912
2        a20 -0.755704 -0.556427  0.635330
3        a30 -0.131948 -2.773040  2.636289
4        a40  0.827439 -1.507721 -0.983563

In [33]:
df2=df.reindex(['a0','a1','a10','a11','a20','a21','a30','a31','a40','a41'])

In [32]:
df

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a10 -0.069955 -0.908090 -0.781912
a20 -0.755704 -0.556427  0.635330
a30 -0.131948 -2.773040  2.636289
a40  0.827439 -1.507721 -0.983563

In [34]:
df2

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a1        NaN       NaN       NaN
a10 -0.069955 -0.908090 -0.781912
a11       NaN       NaN       NaN
a20 -0.755704 -0.556427  0.635330
a21       NaN       NaN       NaN
a30 -0.131948 -2.773040  2.636289
a31       NaN       NaN       NaN
a40  0.827439 -1.507721 -0.983563
a41       NaN       NaN       NaN

In [36]:
df2.fillna(0)#fill value 0 in place of null

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a1   0.000000  0.000000  0.000000
a10 -0.069955 -0.908090 -0.781912
a11  0.000000  0.000000  0.000000
a20 -0.755704 -0.556427  0.635330
a21  0.000000  0.000000  0.000000
a30 -0.131948 -2.773040  2.636289
a31  0.000000  0.000000  0.000000
a40  0.827439 -1.507721 -0.983563
a41  0.000000  0.000000  0.000000

In [37]:
df2

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a1        NaN       NaN       NaN
a10 -0.069955 -0.908090 -0.781912
a11       NaN       NaN       NaN
a20 -0.755704 -0.556427  0.635330
a21       NaN       NaN       NaN
a30 -0.131948 -2.773040  2.636289
a31       NaN       NaN       NaN
a40  0.827439 -1.507721 -0.983563
a41       NaN       NaN       NaN

In [38]:
df2.fillna(method='pad')# filling with forward propogation

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a1  -1.129443 -0.071093 -0.536263
a10 -0.069955 -0.908090 -0.781912
a11 -0.069955 -0.908090 -0.781912
a20 -0.755704 -0.556427  0.635330
a21 -0.755704 -0.556427  0.635330
a30 -0.131948 -2.773040  2.636289
a31 -0.131948 -2.773040  2.636289
a40  0.827439 -1.507721 -0.983563
a41  0.827439 -1.507721 -0.983563

In [43]:
df2=df2.fillna(df2.mean())

In [45]:
df2.to_csv('data1.csv')

In [44]:
df2

            X         Y         Z
a0  -1.129443 -0.071093 -0.536263
a1  -0.251922 -1.163274  0.193976
a10 -0.069955 -0.908090 -0.781912
a11 -0.251922 -1.163274  0.193976
a20 -0.755704 -0.556427  0.635330
a21 -0.251922 -1.163274  0.193976
a30 -0.131948 -2.773040  2.636289
a31 -0.251922 -1.163274  0.193976
a40  0.827439 -1.507721 -0.983563
a41 -0.251922 -1.163274  0.193976